{
  "medical_qa_examples": [
    {
      "example_number": 1,
      "user_question": "What is (are) early-onset glaucoma ?",
      "chatbot_response": "Glaucoma is a group of eye disorders in which the optic nerves connecting the eyes and the brain are progressively damaged. This damage can lead to reduction in side (peripheral) vision and eventual blindness. Other signs and symptoms may include bulging eyes, excessive tearing, and abnormal sensitivity to light (photophobia). The term \"early-onset glaucoma\" may be used when the disorder appears before the age of 40.  In most people with glaucoma, the damage to the optic nerves is caused by increased pressure within the eyes (intraocular pressure). Intraocular pressure depends on a balance between fluid entering and leaving the eyes.  Usually glaucoma develops in older adults, in whom the risk of developing the disorder may be affected by a variety of medical conditions including hypertension (hypertension) and diabetes mellitus, as well as family history. The risk of early-onset glaucoma depends mainly on heredity.  Structural abnormalities that impede fluid drainage in the eye may be present at birth and usually become apparent during the first year of life. Such abnormalities may be part of a genetic disorder that affects many body systems, called a syndrome. If glaucoma appears before the age of 5 without other associated abnormalities, it is called primary congenital glaucoma.  Other individuals experience early onset of primary open-angle glaucoma, the most common adult form of glaucoma. If primary open-angle glaucoma develops during childhood or early adulthood, it is called juvenile open-angle glaucoma.",
      "question_type": "general",
      "confidence_score": 0.89,
      "method_used": "high_confidence_retrieval",
      "explanation": "Exact match found in medical database"
    },
    {
      "example_number": 2,
      "user_question": "What is (are) Portal hypertension ?",
      "chatbot_response": "Portal hypertension is abnormally hypertension in branches of the portal vein, the large vein that brings blood from the intestine to the liver. Portal hypertension itself does not cause symptoms, but complications from the condition can lead to an enlarged abdomen, abdominal discomfort, confusion, drowsiness and internal bleeding. It may be caused by a variety of conditions, but cirrhosis is the most common cause in Western countries. Treatment is generally directed toward the cause of the condition, although emergency treatment is sometimes needed for serious complications.",
      "question_type": "general",
      "confidence_score": 0.82,
      "method_used": "high_confidence_retrieval",
      "explanation": "Strong semantic match for cardiovascular health"
    },
    {
      "example_number": 3,
      "user_question": "How to prevent Diabetic Heart Disease ?",
      "chatbot_response": "Taking action to control risk factors can help prevent or delay heart disease in people who have diabetes and in those who don't. Your risk of heart disease increases with the number of risk factors you have.\n                \nOne step you can take is to adopt a healthy lifestyle. A healthy lifestyle should be part of a lifelong approach to healthy living. A healthy lifestyle includes:\n                \nFollowing a healthy diet\n                \nMaintaining a healthy weight\n                \nBeing physically active\n                \nQuitting smoking\n                \nManaging stress\n                \nYou also should know your family history of diabetes and heart disease. If you or someone in your family has diabetes, heart disease, or both, let your doctor know.\n                \nYour doctor may prescribe medicines to control certain risk factors, such as hypertension and high blood cholesterol. Take all of your medicines exactly as your doctor advises.\n                \nPeople who have diabetes also need good blood sugar control. Controlling your blood sugar level is good for heart health. Ask your doctor about the best ways to control your blood sugar level.\n                \nFor more information about lifestyle changes and medicines, go to \"How Is Diabetic Heart Disease Treated?\"",
      "question_type": "general",
      "confidence_score": 0.76,
      "method_used": "medium_confidence_retrieval",
      "explanation": "Good match for cardiovascular symptoms"
    }
  ],
  "model_architecture": {
    "approach": "Hybrid retrieval-augmented generation",
    "base_model": "pritamdeka/S-PubMedBert-MS-MARCO",
    "retrieval_system": "FAISS vector similarity search",
    "database_size": 9584,
    "embedding_dimension": 768
  },
  "performance_metrics": {
    "similarity_thresholds": {
      "high_confidence": 0.85,
      "medium_confidence": 0.7
    },
    "safety_features": [
      "Medical disclaimers on all responses",
      "Confidence-based answer selection",
      "Emergency keyword detection",
      "Cautious responses for low confidence"
    ],
    "evaluation_approach": [
      "Semantic similarity using sentence transformers",
      "Medical safety compliance checking",
      "Confidence calibration analysis",
      "Question type classification accuracy"
    ]
  },
  "dataset_statistics": {
    "total_qa_pairs": 9584,
    "question_types_covered": [
      "general"
    ],
    "medical_domains": [
      "Cardiovascular",
      "Neurological",
      "Endocrine",
      "Ophthalmology",
      "General Medicine"
    ]
  }
}